
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       39 |           3 |           36 |
## Affected resources by action

|  Action  | Resources                                                                                      |
|:--------:|:-----------------------------------------------------------------------------------------------|
|    🟢    | `module.kc_db_password.aws_secretsmanager_secret.secret`                                       |
|    🟢    | `module.kc_db_password.aws_secretsmanager_secret_version.current`                              |
|    🟢    | `module.keycloak.aws_key_pair.ecs`                                                             |
|    🟢    | `module.keycloak.tls_private_key.rsa`                                                          |
|    🟢    | `module.keycloak_admin_password.aws_secretsmanager_secret.secret`                              |
|    🟢    | `module.keycloak_admin_password.aws_secretsmanager_secret_version.current`                     |
|    🟢    | `module.keycloak.module.pod[0].aws_acm_certificate.website`                                    |
|    🟢    | `module.keycloak.module.pod[0].aws_acm_certificate_validation.website`                         |
|    🟢    | `module.keycloak.module.pod[0].aws_alb.website`                                                |
|    🟢    | `module.keycloak.module.pod[0].aws_alb_listener.redirect_to_ssl`                               |
|    🟢    | `module.keycloak.module.pod[0].aws_alb_listener_rule.website`                                  |
|    🟢    | `module.keycloak.module.pod[0].aws_alb_target_group.website`                                   |
|    🟢    | `module.keycloak.module.pod[0].aws_autoscaling_group.website`                                  |
|    🟢    | `module.keycloak.module.pod[0].aws_autoscaling_policy.cpu_load`                                |
|    🟢    | `module.keycloak.module.pod[0].aws_launch_template.website`                                    |
|    🟢    | `module.keycloak.module.pod[0].aws_lb_listener.ssl`                                            |
|    🟢    | `module.keycloak.module.pod[0].aws_route53_record.cert_validation["auth.infrahouse.com"]`      |
|    🟢    | `module.keycloak.module.pod[0].aws_route53_record.extra[0]`                                    |
|    🟢    | `module.keycloak.module.pod[0].aws_s3_bucket.access_log[0]`                                    |
|    🟢    | `module.keycloak.module.pod[0].aws_s3_bucket_policy.access_logs[0]`                            |
|    🟢    | `module.keycloak.module.pod[0].aws_s3_bucket_public_access_block.public_access[0]`             |
|    🟢    | `module.keycloak.module.pod[0].aws_security_group.alb`                                         |
|    🟢    | `module.keycloak.module.pod[0].aws_security_group.backend`                                     |
|    🟢    | `module.keycloak.module.pod[0].aws_vpc_security_group_egress_rule.alb_outgoing`                |
|    🟢    | `module.keycloak.module.pod[0].aws_vpc_security_group_egress_rule.backend_outgoing`            |
|    🟢    | `module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.alb_icmp`                   |
|    🟢    | `module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.alb_listener_port`          |
|    🟢    | `module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.backend_icmp`               |
|    🟢    | `module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.backend_ssh_local`          |
|    🟢    | `module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.backend_user_traffic`       |
|    🟢    | `module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.https`                      |
|    🟢    | `module.keycloak.module.pod[0].random_string.profile_suffix`                                   |
|    🟢    | `module.keycloak.module.pod[0].module.instance_profile.aws_iam_instance_profile.profile`       |
|    🟢    | `module.keycloak.module.pod[0].module.instance_profile.aws_iam_policy.profile`                 |
|    🟢    | `module.keycloak.module.pod[0].module.instance_profile.aws_iam_role.profile`                   |
|    🟢    | `module.keycloak.module.pod[0].module.instance_profile.aws_iam_role_policy_attachment.profile` |
|    🟢    | `module.keycloak.module.pod[0].module.instance_profile.aws_iam_role_policy_attachment.ssm[0]`  |
|    🟡    | `module.keycloak.aws_ecs_cluster.ecs`                                                          |
|    🟡    | `module.keycloak.aws_ecs_service.ecs`                                                          |
|    🟡    | `module.keycloak.aws_iam_role.ecs_task_execution_role`                                         |
|    🔴    | `aws_secretsmanager_secret.keycloak_admin_creds`                                               |
|    🔴    | `aws_secretsmanager_secret.keycloak_service`                                                   |
|    🔴    | `aws_secretsmanager_secret_version.keycloak_admin_creds`                                       |
|    🔴    | `aws_secretsmanager_secret_version.keycloak_service`                                           |
|    🔴    | `module.keycloak.module.pod.aws_acm_certificate.website`                                       |
|    🔴    | `module.keycloak.module.pod.aws_acm_certificate_validation.website`                            |
|    🔴    | `module.keycloak.module.pod.aws_alb.website`                                                   |
|    🔴    | `module.keycloak.module.pod.aws_alb_listener.redirect_to_ssl`                                  |
|    🔴    | `module.keycloak.module.pod.aws_alb_listener_rule.website`                                     |
|    🔴    | `module.keycloak.module.pod.aws_alb_target_group.website`                                      |
|    🔴    | `module.keycloak.module.pod.aws_autoscaling_group.website`                                     |
|    🔴    | `module.keycloak.module.pod.aws_autoscaling_policy.cpu_load`                                   |
|    🔴    | `module.keycloak.module.pod.aws_launch_template.website`                                       |
|    🔴    | `module.keycloak.module.pod.aws_lb_listener.ssl`                                               |
|    🔴    | `module.keycloak.module.pod.aws_route53_record.cert_validation["auth.infrahouse.com"]`         |
|    🔴    | `module.keycloak.module.pod.aws_route53_record.extra[0]`                                       |
|    🔴    | `module.keycloak.module.pod.aws_s3_bucket.access_log[0]`                                       |
|    🔴    | `module.keycloak.module.pod.aws_s3_bucket_policy.access_logs[0]`                               |
|    🔴    | `module.keycloak.module.pod.aws_s3_bucket_public_access_block.public_access[0]`                |
|    🔴    | `module.keycloak.module.pod.aws_security_group.alb`                                            |
|    🔴    | `module.keycloak.module.pod.aws_security_group.backend`                                        |
|    🔴    | `module.keycloak.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing`                   |
|    🔴    | `module.keycloak.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing`               |
|    🔴    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp`                      |
|    🔴    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port`             |
|    🔴    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp`                  |
|    🔴    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local`             |
|    🔴    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic`          |
|    🔴    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.https`                         |
|    🔴    | `module.keycloak.module.pod.random_string.profile_suffix`                                      |
|    🔴    | `module.keycloak.module.pod.module.instance_profile.aws_iam_instance_profile.profile`          |
|    🔴    | `module.keycloak.module.pod.module.instance_profile.aws_iam_policy.profile`                    |
|    🔴    | `module.keycloak.module.pod.module.instance_profile.aws_iam_role.profile`                      |
|    🔴    | `module.keycloak.module.pod.module.instance_profile.aws_iam_role_policy_attachment.profile`    |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_secretsmanager_secret.keycloak_admin_creds will be destroyed
  # (because aws_secretsmanager_secret.keycloak_admin_creds is not in configuration)
  - resource "aws_secretsmanager_secret" "keycloak_admin_creds" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd" -> null
      - description                    = "A json with username/password keys with keycloak credentials" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd" -> null
      - name                           = "keycloak_admin_credentials20240302224352142500000001" -> null
      - name_prefix                    = "keycloak_admin_credentials" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.keycloak_service will be destroyed
  # (because aws_secretsmanager_secret.keycloak_service is not in configuration)
  - resource "aws_secretsmanager_secret" "keycloak_service" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_service20240303174856808900000002-K6ZwdC" -> null
      - description                    = "A JSON with username/password keys - MySQL account used by keycloak service" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_service20240303174856808900000002-K6ZwdC" -> null
      - name                           = "keycloak_service20240303174856808900000002" -> null
      - name_prefix                    = "keycloak_service" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.keycloak_admin_creds will be destroyed
  # (because aws_secretsmanager_secret_version.keycloak_admin_creds is not in configuration)
  - resource "aws_secretsmanager_secret_version" "keycloak_admin_creds" {
      - arn              = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd" -> null
      - id               = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd|terraform-20240302224352723300000003" -> null
      - secret_id        = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20240302224352723300000003" -> null
      - version_stages   = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.keycloak_service will be destroyed
  # (because aws_secretsmanager_secret_version.keycloak_service is not in configuration)
  - resource "aws_secretsmanager_secret_version" "keycloak_service" {
      - arn              = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_service20240303174856808900000002-K6ZwdC" -> null
      - id               = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_service20240303174856808900000002-K6ZwdC|terraform-20240303174857073500000005" -> null
      - secret_id        = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_service20240303174856808900000002-K6ZwdC" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20240303174857073500000005" -> null
      - version_stages   = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.kc_db_password.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/kc_db_password/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.kc_db_password.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Keycloak DB password"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "keycloak_db_password"
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ValidateResourcePolicy",
                          + "secretsmanager:UpdateSecretVersionStage",
                          + "secretsmanager:UpdateSecret",
                          + "secretsmanager:UntagResource",
                          + "secretsmanager:TagResource",
                          + "secretsmanager:StopReplicationToReplica",
                          + "secretsmanager:RotateSecret",
                          + "secretsmanager:RestoreSecret",
                          + "secretsmanager:ReplicateSecretToRegions",
                          + "secretsmanager:RemoveRegionsFromReplication",
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:PutResourcePolicy",
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:DeleteSecret",
                          + "secretsmanager:DeleteResourcePolicy",
                          + "secretsmanager:CreateSecret",
                          + "secretsmanager:CancelRotateSecret",
                          + "secretsmanager:BatchGetSecretValue",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      + tags_all                       = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }

      + replica (known after apply)
    }

  # module.kc_db_password.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (sensitive value)
    }

  # module.keycloak.aws_ecs_capacity_provider.ecs must be replaced
-/+ resource "aws_ecs_capacity_provider" "ecs" {
      ~ arn      = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/auth" -> (known after apply)
      ~ id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/auth" -> (known after apply)
        name     = "auth"
      ~ tags     = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/ecs/aws"
            "environment"           = "development"
          - "module_version"        = "3.14.0" -> null
            "service"               = "auth"
        }
      ~ tags_all = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          - "module_version"        = "3.14.0" -> null
            # (5 unchanged elements hidden)
        }

      ~ auto_scaling_group_provider {
          ~ auto_scaling_group_arn         = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:dca7af49-ec82-4f24-a68b-df423c340138:autoScalingGroupName/auth2024030222363784960000000d" -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.keycloak.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/auth"
        name     = "auth"
      ~ tags     = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/ecs/aws"
            "environment"           = "development"
          ~ "module_version"        = "3.14.0" -> "5.8.2"
            "service"               = "auth"
        }
      ~ tags_all = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          ~ "module_version"        = "3.14.0" -> "5.8.2"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/auth/auth"
        name                               = "auth"
      ~ tags                               = {
          - "account"                         = "493370826424"
          - "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMDY1MzNlOTA2ZDc4NGIyYTUiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMGRhOTVkMzY4ZWMwYmNiZGIiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTA4NGE0YjRhNzk1NjI3NWU2IiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTBiYmI3OTIwMmRk"
          - "created_by_module"               = "infrahouse/ecs/aws"
          - "environment"                     = "development"
          - "execution_role_arn"              = "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005"
          - "instance_role_policy_attachment" = "auth-instance-czqdboofg13020241001134545613900000004-20241001134546591300000008"
          - "instance_role_policy_name"       = "auth-instance-czqdboofg13020241001134545611100000003"
          - "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c"
          - "module_version"                  = "3.14.0"
          - "service"                         = "auth"
          - "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59"
        } -> (known after apply)
      ~ tags_all                           = {
          - "account"                         = "493370826424"
          - "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMDY1MzNlOTA2ZDc4NGIyYTUiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMGRhOTVkMzY4ZWMwYmNiZGIiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTA4NGE0YjRhNzk1NjI3NWU2IiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTBiYmI3OTIwMmRk"
          - "created_by"                      = "infrahouse/aws-control-493370826424"
          - "created_by_module"               = "infrahouse/ecs/aws"
          - "environment"                     = "development"
          - "execution_role_arn"              = "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005"
          - "instance_role_policy_attachment" = "auth-instance-czqdboofg13020241001134545613900000004-20241001134546591300000008"
          - "instance_role_policy_name"       = "auth-instance-czqdboofg13020241001134545611100000003"
          - "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c"
          - "module_version"                  = "3.14.0"
          - "service"                         = "auth"
          - "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59"
        } -> (known after apply)
      ~ task_definition                    = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth:10" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ deployment_circuit_breaker {
          ~ enable   = false -> true
          ~ rollback = false -> true
        }

      - load_balancer {
          - container_name   = "auth" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "auth"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.keycloak.aws_ecs_task_definition.ecs must be replaced
-/+ resource "aws_ecs_task_definition" "ecs" {
      ~ arn                      = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth:10" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth" -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "auth" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 10 -> (known after apply)
      ~ tags                     = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/ecs/aws"
            "environment"           = "development"
          - "module_version"        = "3.14.0" -> null
            "service"               = "auth"
        }
      ~ tags_all                 = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          - "module_version"        = "3.14.0" -> null
            # (5 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.keycloak.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "authTaskExecutionRole20241001134545655900000005"
        name                  = "authTaskExecutionRole20241001134545655900000005"
      ~ tags                  = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/ecs/aws"
            "environment"           = "development"
          - "module_version"        = "3.14.0" -> null
            "service"               = "auth"
        }
      ~ tags_all              = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          - "module_version"        = "3.14.0" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.keycloak.aws_key_pair.ecs will be created
  + resource "aws_key_pair" "ecs" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = "auth-"
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/ecs/aws"
          + "environment"           = "development"
          + "service"               = "auth"
        }
      + tags_all        = {
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/ecs/aws"
          + "environment"           = "development"
          + "service"               = "auth"
        }
    }

  # module.keycloak.tls_private_key.rsa will be created
  + resource "tls_private_key" "rsa" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.keycloak_admin_password.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/keycloak_admin_password/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.keycloak_admin_password.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Keycloak admin password"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "keycloak_admin_password"
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ValidateResourcePolicy",
                          + "secretsmanager:UpdateSecretVersionStage",
                          + "secretsmanager:UpdateSecret",
                          + "secretsmanager:UntagResource",
                          + "secretsmanager:TagResource",
                          + "secretsmanager:StopReplicationToReplica",
                          + "secretsmanager:RotateSecret",
                          + "secretsmanager:RestoreSecret",
                          + "secretsmanager:ReplicateSecretToRegions",
                          + "secretsmanager:RemoveRegionsFromReplication",
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:PutResourcePolicy",
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:DeleteSecret",
                          + "secretsmanager:DeleteResourcePolicy",
                          + "secretsmanager:CreateSecret",
                          + "secretsmanager:CancelRotateSecret",
                          + "secretsmanager:BatchGetSecretValue",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      + tags_all                       = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }

      + replica (known after apply)
    }

  # module.keycloak_admin_password.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (sensitive value)
    }

  # module.keycloak.module.pod.aws_acm_certificate.website will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_acm_certificate" "website" {
      - arn                       = "arn:aws:acm:us-west-1:493370826424:certificate/833268fe-cb8e-4613-97cb-1f1548952f1a" -> null
      - domain_name               = "auth.infrahouse.com" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "auth.infrahouse.com"
              - resource_record_name  = "_896b3c1fdc69f951f23cbb89d74549e8.auth.infrahouse.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_ecaaea5deaf62835431427a7df45e883.mhbtsbpdnt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-west-1:493370826424:certificate/833268fe-cb8e-4613-97cb-1f1548952f1a" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2026-03-02T23:59:59Z" -> null
      - not_before                = "2025-01-31T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [
          - {
              - renewal_status        = "SUCCESS"
              - updated_at            = "2025-01-31T00:36:24Z"
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "auth.infrahouse.com",
        ] -> null
      - tags                      = {
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all                  = {
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.keycloak.module.pod.aws_acm_certificate_validation.website will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_acm_certificate_validation" "website" {
      - certificate_arn         = "arn:aws:acm:us-west-1:493370826424:certificate/833268fe-cb8e-4613-97cb-1f1548952f1a" -> null
      - id                      = "2024-03-02 22:36:51.087 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_896b3c1fdc69f951f23cbb89d74549e8.auth.infrahouse.com",
        ] -> null
    }

  # module.keycloak.module.pod.aws_alb.website will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_alb" "website" {
      - arn                                                          = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c" -> null
      - arn_suffix                                                   = "app/auth2024030222363678900000000a/a26578ce41c8310c" -> null
      - client_keep_alive                                            = 3600 -> null
      - desync_mitigation_mode                                       = "defensive" -> null
      - dns_name                                                     = "auth2024030222363678900000000a-515275064.us-west-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                                   = false -> null
      - enable_cross_zone_load_balancing                             = true -> null
      - enable_deletion_protection                                   = false -> null
      - enable_http2                                                 = true -> null
      - enable_tls_version_and_cipher_suite_headers                  = false -> null
      - enable_waf_fail_open                                         = false -> null
      - enable_xff_client_port                                       = false -> null
      - enable_zonal_shift                                           = false -> null
      - id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c" -> null
      - idle_timeout                                                 = 60 -> null
      - internal                                                     = false -> null
      - ip_address_type                                              = "ipv4" -> null
      - load_balancer_type                                           = "application" -> null
      - name                                                         = "auth2024030222363678900000000a" -> null
      - name_prefix                                                  = "auth" -> null
      - preserve_host_header                                         = false -> null
      - security_groups                                              = [
          - "sg-04a8761a74826b4f8",
        ] -> null
      - subnets                                                      = [
          - "subnet-04b8845d896c6ebde",
          - "subnet-0df885dcc99418799",
        ] -> null
      - tags                                                         = {
          - "access_log_bucket"        = "auth-access-log-20240523222424592900000001"
          - "access_log_bucket_policy" = "auth-access-log-20240523222424592900000001"
          - "account"                  = "493370826424"
          - "created_by_module"        = "infrahouse/website-pod/aws"
          - "environment"              = "development"
          - "service"                  = "auth"
        } -> null
      - tags_all                                                     = {
          - "access_log_bucket"        = "auth-access-log-20240523222424592900000001"
          - "access_log_bucket_policy" = "auth-access-log-20240523222424592900000001"
          - "account"                  = "493370826424"
          - "created_by"               = "infrahouse/aws-control-493370826424"
          - "created_by_module"        = "infrahouse/website-pod/aws"
          - "environment"              = "development"
          - "service"                  = "auth"
        } -> null
      - vpc_id                                                       = "vpc-08e19d859c26d18b2" -> null
      - xff_header_processing_mode                                   = "append" -> null
      - zone_id                                                      = "Z368ELLRRE2KJ0" -> null
        # (2 unchanged attributes hidden)

      - access_logs {
          - bucket  = "auth-access-log-20240523222424592900000001" -> null
          - enabled = true -> null
            # (1 unchanged attribute hidden)
        }

      - connection_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - subnet_mapping {
          - subnet_id            = "subnet-04b8845d896c6ebde" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-0df885dcc99418799" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.keycloak.module.pod.aws_alb_listener.redirect_to_ssl will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_alb_listener" "redirect_to_ssl" {
      - arn                                                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/3f453601d67d421e" -> null
      - id                                                                  = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/3f453601d67d421e" -> null
      - load_balancer_arn                                                   = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c" -> null
      - port                                                                = 80 -> null
      - protocol                                                            = "HTTP" -> null
      - routing_http_response_server_enabled                                = true -> null
      - tags                                                                = {} -> null
      - tags_all                                                            = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
        # (11 unchanged attributes hidden)

      - default_action {
          - order            = 1 -> null
          - type             = "redirect" -> null
            # (1 unchanged attribute hidden)

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # module.keycloak.module.pod.aws_alb_listener_rule.website will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_alb_listener_rule" "website" {
      - arn          = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener-rule/app/auth2024030222363678900000000a/a26578ce41c8310c/97b5ffe4c9e007df/e68211387ae1ee7c" -> null
      - id           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener-rule/app/auth2024030222363678900000000a/a26578ce41c8310c/97b5ffe4c9e007df/e68211387ae1ee7c" -> null
      - listener_arn = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/97b5ffe4c9e007df" -> null
      - priority     = 99 -> null
      - tags         = {
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all     = {
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null

      - action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59" -> null
          - type             = "forward" -> null
        }

      - condition {
          - host_header {
              - values = [
                  - "auth.infrahouse.com",
                ] -> null
            }
        }
    }

  # module.keycloak.module.pod.aws_alb_target_group.website will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_alb_target_group" "website" {
      - arn                                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59" -> null
      - arn_suffix                         = "targetgroup/tf-20240302223634861300000006/781ece90bddd8d59" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "tf-20240302223634861300000006" -> null
      - name_prefix                        = "tf-" -> null
      - port                               = 8080 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all                           = {
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-08e19d859c26d18b2" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 60 -> null
          - matcher             = "200-299" -> null
          - path                = "/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 4 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # module.keycloak.module.pod.aws_autoscaling_group.website will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_autoscaling_group" "website" {
      - arn                              = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:dca7af49-ec82-4f24-a68b-df423c340138:autoScalingGroupName/auth2024030222363784960000000d" -> null
      - availability_zones               = [
          - "us-west-1a",
          - "us-west-1c",
        ] -> null
      - capacity_rebalance               = false -> null
      - default_cooldown                 = 300 -> null
      - default_instance_warmup          = 0 -> null
      - desired_capacity                 = 1 -> null
      - enabled_metrics                  = [] -> null
      - force_delete                     = false -> null
      - force_delete_warm_pool           = false -> null
      - health_check_grace_period        = 300 -> null
      - health_check_type                = "EC2" -> null
      - id                               = "auth2024030222363784960000000d" -> null
      - ignore_failed_scaling_activities = false -> null
      - load_balancers                   = [] -> null
      - max_instance_lifetime            = 2592000 -> null
      - max_size                         = 1 -> null
      - metrics_granularity              = "1Minute" -> null
      - min_elb_capacity                 = 1 -> null
      - min_size                         = 1 -> null
      - name                             = "auth2024030222363784960000000d" -> null
      - name_prefix                      = "auth" -> null
      - predicted_capacity               = 0 -> null
      - protect_from_scale_in            = true -> null
      - service_linked_role_arn          = "arn:aws:iam::493370826424:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
      - suspended_processes              = [] -> null
      - target_group_arns                = [] -> null
      - termination_policies             = [] -> null
      - vpc_zone_identifier              = [
          - "subnet-06caf71c8b0afd909",
          - "subnet-0f91dd2675e7a16c3",
        ] -> null
      - wait_for_capacity_timeout        = "20m" -> null
      - warm_pool_size                   = 0 -> null
        # (4 unchanged attributes hidden)

      - availability_zone_distribution {
          - capacity_distribution_strategy = "balanced-best-effort" -> null
        }

      - capacity_reservation_specification {
          - capacity_reservation_preference = "default" -> null
        }

      - instance_maintenance_policy {
          - max_healthy_percentage = 200 -> null
          - min_healthy_percentage = 100 -> null
        }

      - instance_refresh {
          - strategy = "Rolling" -> null
          - triggers = [
              - "tag",
            ] -> null

          - preferences {
              - auto_rollback                = false -> null
              - checkpoint_percentages       = [] -> null
              - max_healthy_percentage       = 100 -> null
              - min_healthy_percentage       = 100 -> null
              - scale_in_protected_instances = "Refresh" -> null
              - skip_matching                = false -> null
              - standby_instances            = "Ignore" -> null
                # (2 unchanged attributes hidden)
            }
        }

      - mixed_instances_policy {
          - instances_distribution {
              - on_demand_allocation_strategy            = "prioritized" -> null
              - on_demand_base_capacity                  = 0 -> null
              - on_demand_percentage_above_base_capacity = 0 -> null
              - spot_allocation_strategy                 = "lowest-price" -> null
              - spot_instance_pools                      = 2 -> null
                # (1 unchanged attribute hidden)
            }
          - launch_template {
              - launch_template_specification {
                  - launch_template_id   = "lt-0d93139ab32de43aa" -> null
                  - launch_template_name = "auth2024030222363750480000000b" -> null
                  - version              = "4" -> null
                }
            }
        }

      - tag {
          - key                 = "AmazonECSManaged" -> null
          - propagate_at_launch = true -> null
          - value               = "true" -> null
        }
      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "auth" -> null
        }
      - tag {
          - key                 = "account" -> null
          - propagate_at_launch = true -> null
          - value               = "493370826424" -> null
        }
      - tag {
          - key                 = "created_by" -> null
          - propagate_at_launch = true -> null
          - value               = "infrahouse/aws-control-493370826424" -> null
        }
      - tag {
          - key                 = "created_by_module" -> null
          - propagate_at_launch = true -> null
          - value               = "infrahouse/website-pod/aws" -> null
        }
      - tag {
          - key                 = "environment" -> null
          - propagate_at_launch = true -> null
          - value               = "production" -> null
        }
      - tag {
          - key                 = "parent_module" -> null
          - propagate_at_launch = true -> null
          - value               = "infrahouse/ecs/aws" -> null
        }
      - tag {
          - key                 = "parent_module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.14.0" -> null
        }
      - tag {
          - key                 = "service" -> null
          - propagate_at_launch = true -> null
          - value               = "auth" -> null
        }
    }

  # module.keycloak.module.pod.aws_autoscaling_policy.cpu_load will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_autoscaling_policy" "cpu_load" {
      - arn                       = "arn:aws:autoscaling:us-west-1:493370826424:scalingPolicy:968ae41b-8c06-435e-8e93-aa5c4724f821:autoScalingGroupName/auth2024030222363784960000000d:policyName/auth2024030222363784960000000d" -> null
      - autoscaling_group_name    = "auth2024030222363784960000000d" -> null
      - cooldown                  = 0 -> null
      - enabled                   = true -> null
      - estimated_instance_warmup = 0 -> null
      - id                        = "auth2024030222363784960000000d" -> null
      - min_adjustment_magnitude  = 0 -> null
      - name                      = "auth2024030222363784960000000d" -> null
      - policy_type               = "TargetTrackingScaling" -> null
      - scaling_adjustment        = 0 -> null
        # (2 unchanged attributes hidden)

      - target_tracking_configuration {
          - disable_scale_in = false -> null
          - target_value     = 80 -> null

          - predefined_metric_specification {
              - predefined_metric_type = "ASGAverageCPUUtilization" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.keycloak.module.pod.aws_launch_template.website will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_launch_template" "website" {
      - arn                                  = "arn:aws:ec2:us-west-1:493370826424:launch-template/lt-0d93139ab32de43aa" -> null
      - default_version                      = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - id                                   = "lt-0d93139ab32de43aa" -> null
      - image_id                             = "ami-0c535e24abbf12738" -> null
      - instance_type                        = "t3.small" -> null
      - key_name                             = "aleks-Black-MBP" -> null
      - latest_version                       = 4 -> null
      - name                                 = "auth2024030222363750480000000b" -> null
      - name_prefix                          = "auth" -> null
      - security_group_names                 = [] -> null
      - tags                                 = {} -> null
      - tags_all                             = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJydW5jbWQiOgotICJmYWxsb2NhdGUgLWwgNDA5Nk0gL3N3YXBmaWxlIgotICJjaG1vZCA2MDAgL3N3YXBmaWxlIgotICJta3N3YXAgL3N3YXBmaWxlIgotICJzd2Fwb24gL3N3YXBmaWxlIgoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIEVDU19DTFVTVEVSPWF1dGgKICAgIEVDU19MT0dMRVZFTD1kZWJ1ZwogICAgRUNTX0FMTE9XX09GRkhPU1RfSU5UUk9TUEVDVElPTl9BQ0NFU1M9dHJ1ZQogICJwYXRoIjogIi9ldGMvZWNzL2Vjcy5jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K" -> null
      - vpc_security_group_ids               = [
          - "sg-06533e906d784b2a5",
        ] -> null
        # (5 unchanged attributes hidden)

      - block_device_mappings {
          - device_name  = "/dev/xvda" -> null
            # (2 unchanged attributes hidden)

          - ebs {
              - delete_on_termination      = "true" -> null
              - iops                       = 0 -> null
              - throughput                 = 0 -> null
              - volume_initialization_rate = 0 -> null
              - volume_size                = 30 -> null
                # (4 unchanged attributes hidden)
            }
        }

      - iam_instance_profile {
          - arn  = "arn:aws:iam::493370826424:instance-profile/auth-instance-czqdboofg130" -> null
            name = null
        }

      - metadata_options {
          - http_put_response_hop_limit = 0 -> null
          - http_tokens                 = "required" -> null
            # (3 unchanged attributes hidden)
        }

      - tag_specifications {
          - resource_type = "volume" -> null
          - tags          = {
              - "account"           = "493370826424"
              - "created_by"        = "infrahouse/aws-control-493370826424"
              - "created_by_module" = "infrahouse/website-pod/aws"
              - "environment"       = "development"
              - "service"           = "auth"
            } -> null
        }
      - tag_specifications {
          - resource_type = "network-interface" -> null
          - tags          = {
              - "account"           = "493370826424"
              - "created_by"        = "infrahouse/aws-control-493370826424"
              - "created_by_module" = "infrahouse/website-pod/aws"
              - "environment"       = "development"
              - "service"           = "auth"
            } -> null
        }
    }

  # module.keycloak.module.pod.aws_lb_listener.ssl will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_lb_listener" "ssl" {
      - arn                                                                   = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/97b5ffe4c9e007df" -> null
      - certificate_arn                                                       = "arn:aws:acm:us-west-1:493370826424:certificate/833268fe-cb8e-4613-97cb-1f1548952f1a" -> null
      - id                                                                    = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/97b5ffe4c9e007df" -> null
      - load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c" -> null
      - port                                                                  = 443 -> null
      - protocol                                                              = "HTTPS" -> null
      - routing_http_response_server_enabled                                  = true -> null
      - ssl_policy                                                            = "ELBSecurityPolicy-2016-08" -> null
      - tags                                                                  = {
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all                                                              = {
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
        # (18 unchanged attributes hidden)

      - default_action {
          - order            = 1 -> null
          - type             = "fixed-response" -> null
            # (1 unchanged attribute hidden)

          - fixed_response {
              - content_type = "text/plain" -> null
              - message_body = "The server cannot or will not process the request due to an apparent client error (e.g., malformed request syntax, size too large, invalid request message framing, or deceptive request routing)." -> null
              - status_code  = "400" -> null
            }
        }

      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.keycloak.module.pod.aws_route53_record.cert_validation["auth.infrahouse.com"] will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_route53_record" "cert_validation" {
      - fqdn                             = "_896b3c1fdc69f951f23cbb89d74549e8.auth.infrahouse.com" -> null
      - id                               = "Z07662251LH3YRF2ERM3G__896b3c1fdc69f951f23cbb89d74549e8.auth.infrahouse.com._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_896b3c1fdc69f951f23cbb89d74549e8.auth.infrahouse.com" -> null
      - records                          = [
          - "_ecaaea5deaf62835431427a7df45e883.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z07662251LH3YRF2ERM3G" -> null
        # (2 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.aws_route53_record.extra[0] will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_route53_record" "extra" {
      - fqdn                             = "auth.infrahouse.com" -> null
      - id                               = "Z07662251LH3YRF2ERM3G_auth.infrahouse.com_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "auth.infrahouse.com" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z07662251LH3YRF2ERM3G" -> null
        # (2 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "auth2024030222363678900000000a-515275064.us-west-1.elb.amazonaws.com" -> null
          - zone_id                = "Z368ELLRRE2KJ0" -> null
        }
    }

  # module.keycloak.module.pod.aws_s3_bucket.access_log[0] will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_s3_bucket" "access_log" {
      - arn                         = "arn:aws:s3:::auth-access-log-20240523222424592900000001" -> null
      - bucket                      = "auth-access-log-20240523222424592900000001" -> null
      - bucket_domain_name          = "auth-access-log-20240523222424592900000001.s3.amazonaws.com" -> null
      - bucket_prefix               = "auth-access-log-" -> null
      - bucket_regional_domain_name = "auth-access-log-20240523222424592900000001.s3.us-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null
      - id                          = "auth-access-log-20240523222424592900000001" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::027434742980:root"
                        }
                      - Resource  = "arn:aws:s3:::auth-access-log-20240523222424592900000001/AWSLogs/493370826424/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all                    = {
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "f9b76c5b46d79a649a8155275fbbacb43c0c609135563f4fba55399ca8a70d4b" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.keycloak.module.pod.aws_s3_bucket_policy.access_logs[0] will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_s3_bucket_policy" "access_logs" {
      - bucket = "auth-access-log-20240523222424592900000001" -> null
      - id     = "auth-access-log-20240523222424592900000001" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::027434742980:root"
                        }
                      - Resource  = "arn:aws:s3:::auth-access-log-20240523222424592900000001/AWSLogs/493370826424/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.keycloak.module.pod.aws_s3_bucket_public_access_block.public_access[0] will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "public_access" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "auth-access-log-20240523222424592900000001" -> null
      - id                      = "auth-access-log-20240523222424592900000001" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.keycloak.module.pod.aws_security_group.alb will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_security_group" "alb" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-04a8761a74826b4f8" -> null
      - description            = "Load balancer security group for service auth" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-04a8761a74826b4f8" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all ICMP traffic"
              - from_port        = -1
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = -1
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "User traffic to HTTPS port"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "User traffic to port 80"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "web-20240302223634859900000004" -> null
      - name_prefix            = "web-" -> null
      - owner_id               = "493370826424" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"              = "auth load balancer"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all               = {
          - "Name"              = "auth load balancer"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - vpc_id                 = "vpc-08e19d859c26d18b2" -> null
    }

  # module.keycloak.module.pod.aws_security_group.backend will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_security_group" "backend" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-06533e906d784b2a5" -> null
      - description            = "Backend security group for service auth" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-06533e906d784b2a5" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all ICMP traffic"
              - from_port        = -1
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = -1
            },
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/22",
                ]
              - description      = "SSH access from the service auth VPC"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = []
              - description      = "Any traffic from the Load Balancer"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-04a8761a74826b4f8",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "web-20240302223634852900000002" -> null
      - name_prefix            = "web-" -> null
      - owner_id               = "493370826424" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"              = "auth backend"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all               = {
          - "Name"              = "auth backend"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - vpc_id                 = "vpc-08e19d859c26d18b2" -> null
    }

  # module.keycloak.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-08c12a045e8ba9745" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - id                     = "sgr-08c12a045e8ba9745" -> null
      - ip_protocol            = "-1" -> null
      - security_group_id      = "sg-04a8761a74826b4f8" -> null
      - security_group_rule_id = "sgr-08c12a045e8ba9745" -> null
      - tags                   = {
          - "Name"              = "outgoing traffic"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all               = {
          - "Name"              = "outgoing traffic"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
    }

  # module.keycloak.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-084a4b4a7956275e6" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - id                     = "sgr-084a4b4a7956275e6" -> null
      - ip_protocol            = "-1" -> null
      - security_group_id      = "sg-06533e906d784b2a5" -> null
      - security_group_rule_id = "sgr-084a4b4a7956275e6" -> null
      - tags                   = {
          - "Name"              = "outgoing traffic"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all               = {
          - "Name"              = "outgoing traffic"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-05b0c467d0cc6084a" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "Allow all ICMP traffic" -> null
      - from_port              = -1 -> null
      - id                     = "sgr-05b0c467d0cc6084a" -> null
      - ip_protocol            = "icmp" -> null
      - security_group_id      = "sg-04a8761a74826b4f8" -> null
      - security_group_rule_id = "sgr-05b0c467d0cc6084a" -> null
      - tags                   = {
          - "Name"              = "ICMP traffic"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all               = {
          - "Name"              = "ICMP traffic"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - to_port                = -1 -> null
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0cc902990fde04156" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "User traffic to port 80" -> null
      - from_port              = 80 -> null
      - id                     = "sgr-0cc902990fde04156" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-04a8761a74826b4f8" -> null
      - security_group_rule_id = "sgr-0cc902990fde04156" -> null
      - tags                   = {
          - "Name"              = "user traffic"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all               = {
          - "Name"              = "user traffic"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - to_port                = 80 -> null
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0da95d368ec0bcbdb" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "Allow all ICMP traffic" -> null
      - from_port              = -1 -> null
      - id                     = "sgr-0da95d368ec0bcbdb" -> null
      - ip_protocol            = "icmp" -> null
      - security_group_id      = "sg-06533e906d784b2a5" -> null
      - security_group_rule_id = "sgr-0da95d368ec0bcbdb" -> null
      - tags                   = {
          - "Name"              = "ICMP traffic"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all               = {
          - "Name"              = "ICMP traffic"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - to_port                = -1 -> null
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0bbb79202dde3e83d" -> null
      - cidr_ipv4              = "10.0.0.0/22" -> null
      - description            = "SSH access from the service auth VPC" -> null
      - from_port              = 22 -> null
      - id                     = "sgr-0bbb79202dde3e83d" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-06533e906d784b2a5" -> null
      - security_group_rule_id = "sgr-0bbb79202dde3e83d" -> null
      - tags                   = {
          - "Name"              = "SSH local"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all               = {
          - "Name"              = "SSH local"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - to_port                = 22 -> null
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {
      - arn                          = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0a01dea625173be19" -> null
      - description                  = "Any traffic from the Load Balancer" -> null
      - id                           = "sgr-0a01dea625173be19" -> null
      - ip_protocol                  = "-1" -> null
      - referenced_security_group_id = "sg-04a8761a74826b4f8" -> null
      - security_group_id            = "sg-06533e906d784b2a5" -> null
      - security_group_rule_id       = "sgr-0a01dea625173be19" -> null
      - tags                         = {
          - "Name"              = "Load balancer traffic"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all                     = {
          - "Name"              = "Load balancer traffic"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.https will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "https" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-08092ae9826c38ee9" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "User traffic to HTTPS port" -> null
      - from_port              = 443 -> null
      - id                     = "sgr-08092ae9826c38ee9" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-04a8761a74826b4f8" -> null
      - security_group_rule_id = "sgr-08092ae9826c38ee9" -> null
      - tags                   = {
          - "Name"              = "https user traffic"
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - tags_all               = {
          - "Name"              = "https user traffic"
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "development"
          - "service"           = "auth"
        } -> null
      - to_port                = 443 -> null
    }

  # module.keycloak.module.pod.random_string.profile_suffix will be destroyed
  # (because module.keycloak.module.pod is not in configuration)
  - resource "random_string" "profile_suffix" {
      - id          = "czqdboofg130" -> null
      - length      = 12 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "czqdboofg130" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.keycloak.module.pod[0].data.aws_iam_policy_document.access_logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "access_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::027434742980:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.keycloak.module.pod[0].aws_acm_certificate.website will be created
  + resource "aws_acm_certificate" "website" {
      + arn                       = (known after apply)
      + domain_name               = "auth.infrahouse.com"
      + domain_validation_options = [
          + {
              + domain_name           = "auth.infrahouse.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "auth.infrahouse.com",
        ]
      + tags                      = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all                  = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.keycloak.module.pod[0].aws_acm_certificate_validation.website will be created
  + resource "aws_acm_certificate_validation" "website" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.keycloak.module.pod[0].aws_alb.website will be created
  + resource "aws_alb" "website" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "auth"
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-04b8845d896c6ebde",
          + "subnet-0df885dcc99418799",
        ]
      + tags                                                         = (known after apply)
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
        }

      + subnet_mapping (known after apply)
    }

  # module.keycloak.module.pod[0].aws_alb_listener.redirect_to_ssl will be created
  + resource "aws_alb_listener" "redirect_to_ssl" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all                                                              = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.keycloak.module.pod[0].aws_alb_listener_rule.website will be created
  + resource "aws_alb_listener_rule" "website" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 99
      + tags         = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all     = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "auth.infrahouse.com",
                ]
            }
        }
    }

  # module.keycloak.module.pod[0].aws_alb_target_group.website will be created
  + resource "aws_alb_target_group" "website" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all                           = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-08e19d859c26d18b2"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200-299"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = false
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.keycloak.module.pod[0].aws_autoscaling_group.website will be created
  + resource "aws_autoscaling_group" "website" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 2592000
      + max_size                         = 7
      + metrics_granularity              = "1Minute"
      + min_elb_capacity                 = 1
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "auth"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = true
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-06caf71c8b0afd909",
          + "subnet-0f91dd2675e7a16c3",
        ]
      + wait_for_capacity_timeout        = "20m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + instance_maintenance_policy {
          + max_healthy_percentage = 200
          + min_healthy_percentage = 100
        }

      + instance_refresh {
          + strategy = "Rolling"
          + triggers = [
              + "tag",
            ]

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Refresh"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template (known after apply)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }
              + override (known after apply)
            }
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "auth"
        }
      + tag {
          + key                 = "VantaContainsEPHI"
          + propagate_at_launch = true
          + value               = "false"
        }
      + tag {
          + key                 = "VantaContainsUserData"
          + propagate_at_launch = true
          + value               = "false"
        }
      + tag {
          + key                 = "VantaNonProd"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "account"
          + propagate_at_launch = true
          + value               = "493370826424"
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-493370826424"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/website-pod/aws"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "production"
        }
      + tag {
          + key                 = "parent_module"
          + propagate_at_launch = true
          + value               = "infrahouse/ecs/aws"
        }
      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "auth"
        }
      + tag {
          + key                 = "upstream_module"
          + propagate_at_launch = true
          + value               = "infrahouse/ecs/aws"
        }

      + traffic_source (known after apply)
    }

  # module.keycloak.module.pod[0].aws_autoscaling_policy.cpu_load will be created
  + resource "aws_autoscaling_policy" "cpu_load" {
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = (known after apply)
      + policy_type             = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # module.keycloak.module.pod[0].aws_launch_template.website will be created
  + resource "aws_launch_template" "website" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0e2cd7c9727ba7be7"
      + instance_type          = "t3.small"
      + key_name               = "aleks-Black-MBP"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "auth"
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + user_data              = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJydW5jbWQiOgotICJmYWxsb2NhdGUgLWwgNDA5Nk0gL3N3YXBmaWxlIgotICJjaG1vZCA2MDAgL3N3YXBmaWxlIgotICJta3N3YXAgL3N3YXBmaWxlIgotICJzd2Fwb24gL3N3YXBmaWxlIgoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIEVDU19DTFVTVEVSPWF1dGgKICAgIEVDU19MT0dMRVZFTD1kZWJ1ZwogICAgRUNTX0FMTE9XX09GRkhPU1RfSU5UUk9TUEVDVElPTl9BQ0NFU1M9dHJ1ZQogICJwYXRoIjogIi9ldGMvZWNzL2Vjcy5jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K"
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 34
              + volume_type                = (known after apply)
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "AmazonECSManaged"      = "true"
              + "Name"                  = "auth"
              + "VantaContainsEPHI"     = "false"
              + "VantaContainsUserData" = "false"
              + "VantaNonProd"          = "true"
              + "account"               = "493370826424"
              + "created_by"            = "infrahouse/aws-control-493370826424"
              + "created_by_module"     = "infrahouse/website-pod/aws"
              + "environment"           = "development"
              + "parent_module"         = "infrahouse/ecs/aws"
              + "service"               = "auth"
              + "upstream_module"       = "infrahouse/ecs/aws"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "AmazonECSManaged"      = "true"
              + "Name"                  = "auth"
              + "VantaContainsEPHI"     = "false"
              + "VantaContainsUserData" = "false"
              + "VantaNonProd"          = "true"
              + "account"               = "493370826424"
              + "created_by"            = "infrahouse/aws-control-493370826424"
              + "created_by_module"     = "infrahouse/website-pod/aws"
              + "environment"           = "development"
              + "parent_module"         = "infrahouse/ecs/aws"
              + "service"               = "auth"
              + "upstream_module"       = "infrahouse/ecs/aws"
            }
        }
    }

  # module.keycloak.module.pod[0].aws_lb_listener.ssl will be created
  + resource "aws_lb_listener" "ssl" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-Ext1-2021-06"
      + tags                                                                  = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all                                                              = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "The server cannot or will not process the request due to an apparent client error (e.g., malformed request syntax, size too large, invalid request message framing, or deceptive request routing)."
              + status_code  = "400"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.keycloak.module.pod[0].aws_route53_record.cert_validation["auth.infrahouse.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.keycloak.module.pod[0].aws_route53_record.extra[0] will be created
  + resource "aws_route53_record" "extra" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "auth.infrahouse.com"
      + type            = "A"
      + zone_id         = "Z07662251LH3YRF2ERM3G"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.keycloak.module.pod[0].aws_s3_bucket.access_log[0] will be created
  + resource "aws_s3_bucket" "access_log" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "auth-access-log-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all                    = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.keycloak.module.pod[0].aws_s3_bucket_policy.access_logs[0] will be created
  + resource "aws_s3_bucket_policy" "access_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.keycloak.module.pod[0].aws_s3_bucket_public_access_block.public_access[0] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.keycloak.module.pod[0].aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Load balancer security group for service auth"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth load balancer"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth load balancer"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.keycloak.module.pod[0].aws_security_group.backend will be created
  + resource "aws_security_group" "backend" {
      + arn                    = (known after apply)
      + description            = "Backend security group for service auth"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth backend"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth backend"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.keycloak.module.pod[0].aws_vpc_security_group_egress_rule.alb_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "outgoing traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "outgoing traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
    }

  # module.keycloak.module.pod[0].aws_vpc_security_group_egress_rule.backend_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "outgoing traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "outgoing traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
    }

  # module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.alb_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "ICMP traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "ICMP traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + to_port                = -1
    }

  # module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.alb_listener_port will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "User traffic to port 80"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "user traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "user traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + to_port                = 80
    }

  # module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.backend_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "ICMP traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "ICMP traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + to_port                = -1
    }

  # module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.backend_ssh_local will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "SSH access from the service auth VPC"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "SSH local"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "SSH local"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + to_port                = 22
    }

  # module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.backend_user_traffic will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {
      + arn                          = (known after apply)
      + description                  = "Any traffic from the Load Balancer"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "Load balancer traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all                     = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "Load balancer traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
    }

  # module.keycloak.module.pod[0].aws_vpc_security_group_ingress_rule.https will be created
  + resource "aws_vpc_security_group_ingress_rule" "https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "User traffic to HTTPS port"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "https user traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + tags_all               = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "https user traffic"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/website-pod/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/ecs/aws"
        }
      + to_port                = 443
    }

  # module.keycloak.module.pod[0].random_string.profile_suffix will be created
  + resource "random_string" "profile_suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.keycloak.module.pod.module.instance_profile.aws_iam_instance_profile.profile will be destroyed
  # (because module.keycloak.module.pod.module.instance_profile is not in configuration)
  - resource "aws_iam_instance_profile" "profile" {
      - arn         = "arn:aws:iam::493370826424:instance-profile/auth-instance-czqdboofg130" -> null
      - create_date = "2024-10-01T13:45:46Z" -> null
      - id          = "auth-instance-czqdboofg130" -> null
      - name        = "auth-instance-czqdboofg130" -> null
      - path        = "/" -> null
      - role        = "auth-instance-czqdboofg13020241001134545613900000004" -> null
      - tags        = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all    = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
      - unique_id   = "AIPAXFXZRL24C5G2MF7NF" -> null
        # (1 unchanged attribute hidden)
    }

  # module.keycloak.module.pod.module.instance_profile.aws_iam_policy.profile will be destroyed
  # (because module.keycloak.module.pod.module.instance_profile is not in configuration)
  - resource "aws_iam_policy" "profile" {
      - arn              = "arn:aws:iam::493370826424:policy/auth-instance-czqdboofg13020241001134545611100000003" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::493370826424:policy/auth-instance-czqdboofg13020241001134545611100000003" -> null
      - name             = "auth-instance-czqdboofg13020241001134545611100000003" -> null
      - name_prefix      = "auth-instance-czqdboofg130" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ec2:Describe*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ecs:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAXFXZRL24FSQA4LUME" -> null
      - tags             = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all         = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.keycloak.module.pod.module.instance_profile.aws_iam_role.profile will be destroyed
  # (because module.keycloak.module.pod.module.instance_profile is not in configuration)
  - resource "aws_iam_role" "profile" {
      - arn                   = "arn:aws:iam::493370826424:role/auth-instance-czqdboofg13020241001134545613900000004" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-10-01T13:45:45Z" -> null
      - force_detach_policies = false -> null
      - id                    = "auth-instance-czqdboofg13020241001134545613900000004" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::493370826424:policy/auth-instance-czqdboofg13020241001134545611100000003",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "auth-instance-czqdboofg13020241001134545613900000004" -> null
      - name_prefix           = "auth-instance-czqdboofg130" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all              = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
      - unique_id             = "AROAXFXZRL24EW7GO46FE" -> null
        # (2 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.module.instance_profile.aws_iam_role_policy_attachment.profile will be destroyed
  # (because module.keycloak.module.pod.module.instance_profile is not in configuration)
  - resource "aws_iam_role_policy_attachment" "profile" {
      - id         = "auth-instance-czqdboofg13020241001134545613900000004-20241001134546591300000008" -> null
      - policy_arn = "arn:aws:iam::493370826424:policy/auth-instance-czqdboofg13020241001134545611100000003" -> null
      - role       = "auth-instance-czqdboofg13020241001134545613900000004" -> null
    }

  # module.keycloak.module.pod[0].module.instance_profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/instance-profile/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/website-pod/aws"
        }
      + tags_all    = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/instance-profile/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/website-pod/aws"
        }
      + unique_id   = (known after apply)
    }

  # module.keycloak.module.pod[0].module.instance_profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ecs:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/instance-profile/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/website-pod/aws"
        }
      + tags_all         = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/instance-profile/aws"
          + "environment"           = "development"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/website-pod/aws"
        }
    }

  # module.keycloak.module.pod[0].module.instance_profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by_module"     = "infrahouse/instance-profile/aws"
          + "environment"           = "development"
          + "module_version"        = "1.8.1"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/website-pod/aws"
        }
      + tags_all              = {
          + "AmazonECSManaged"      = "true"
          + "Name"                  = "auth"
          + "VantaContainsEPHI"     = "false"
          + "VantaContainsUserData" = "false"
          + "VantaNonProd"          = "true"
          + "account"               = "493370826424"
          + "created_by"            = "infrahouse/aws-control-493370826424"
          + "created_by_module"     = "infrahouse/instance-profile/aws"
          + "environment"           = "development"
          + "module_version"        = "1.8.1"
          + "parent_module"         = "infrahouse/ecs/aws"
          + "service"               = "auth"
          + "upstream_module"       = "infrahouse/website-pod/aws"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.keycloak.module.pod[0].module.instance_profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.keycloak.module.pod[0].module.instance_profile.aws_iam_role_policy_attachment.ssm[0] will be created
  + resource "aws_iam_role_policy_attachment" "ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

Plan: 39 to add, 3 to change, 36 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDM5LCAiY2hhbmdlIjogMywgImRlc3Ryb3kiOiAzNn19
```
</details>